Autodesk.Revit.DB.Geolocation.GeolocationJsonRecord.SetLinearUnit(Autodesk.Revit.DB.ForgeTypeId)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Geolocation.GeolocationJsonRecord.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Geolocation.GeolocationJsonRecord.Json
The JSON data representing the entity.

Autodesk.Revit.DB.Geolocation.GeolocationJsonRecord.ReferenceId
The Id to used to reference this JSON for other entities that hold references to it.

Autodesk.Revit.DB.Geolocation.GeolocationJsonRecord
Used to represent Json data for an object that is part of the Geospatial AECDM schema